In [4]:
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
import numpy as np

In [6]:
# get the dataset, we have 2, one with data on the people, and one with weither they paid there credit or not
app_rec=pd.read_csv("application_record.csv")
cred_rec=pd.read_csv("credit_record.csv")

In [37]:
app_rec.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,0,0,unknown,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,0,0,unknown,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,0,1,1,Sales staff,1.0

In [8]:
app_rec.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      304354 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

We only have Null values in the Occupation_Type others don't have any. There is 134203 null values\
So we are going to replace the Nan values by "unknown", because deleting the lines who have a null value in occupation would make us loose too much lines/data

In [35]:
app_rec=app_rec.fillna("unknown")

Description of the different variables\
CODE_GENDER          What is the gender of the person\
FLAG_OWN_CAR         Does he have a car or not\
FLAG_OWN_REALTY      Does he have a property\
CNT_CHILDREN         Number of children\
AMT_INCOME_TOTAL     Annual income\
NAME_INCOME_TYPE     income category\ 
NAME_EDUCATION_TYPE  Education level\
NAME_FAMILY_STATUS   Marital status\
NAME_HOUSING_TYPE    Way of living\
DAYS_BIRTH           Birthday \
DAYS_EMPLOYED        Start date of employment (Count backwards from current day(0). If positive, it means the person currently unemployed.)  \
FLAG_MOBIL           Is there a mobile phone  \
FLAG_WORK_PHONE      Is there a work phone\
FLAG_PHONE           Is there a phone\
FLAG_EMAIL           Is there an email\
OCCUPATION_TYPE      Occupation work\
CNT_FAM_MEMBERS      Family size

In [14]:
cred_rec.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

ID	Client number \
MONTHS_BALANCE	Record month	The month of the extracted data is the starting point, backwards, 0 is the current month, -1 is the previous month, and so on \
STATUS	Status	0: 1-29 days past due 1: 30-59 days past due 2: 60-89 days overdue 3: 90-119 days overdue 4: 120-149 days overdue 5: Overdue or bad debts, write-offs for more than 150 days C: paid off that month X: No loan for the month

In [16]:
cred_rec.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ID              1048575 non-null  int64
 1   MONTHS_BALANCE  1048575 non-null  int64
 2   STATUS          1048575 non-null  object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

No null values in the cred_rec dataset

In [19]:
unique_counts = pd.DataFrame.from_records([(col, app_rec[col].nunique()) for col in app_rec.columns],
                          columns=['Column_Name', 'Num_Unique'])
unique_counts

            Column_Name  Num_Unique
0                    ID      438510
1           CODE_GENDER           2
2          FLAG_OWN_CAR           2
3       FLAG_OWN_REALTY           2
4          CNT_CHILDREN          12
5      AMT_INCOME_TOTAL         866
6      NAME_INCOME_TYPE           5
7   NAME_EDUCATION_TYPE           5
8    NAME_FAMILY_STATUS           5
9     NAME_HOUSING_TYPE           6
10           DAYS_BIRTH       16379
11        DAYS_EMPLOYED        9406
12           FLAG_MOBIL           1
13      FLAG_WORK_PHONE           2
14           FLAG_PHONE           2
15           FLAG_EMAIL           2
16      OCCUPATION_TYPE          18
17      CNT_FAM_MEMBERS          13

We see that flag_mobil only has 1 values, it is only filled with 1 so this columns gives us 0 information we can just drop it

In [22]:
app_rec = app_rec.drop(columns=['FLAG_MOBIL'])